Revit 2026 API

# BuiltInFailuresDisplacementElementFailures Class

---

Error messages related to the DisplacementElement.

SystemObject Autodesk.Revit.DBBuiltInFailuresDisplacementElementFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DisplacementElementFailures
```
```vb
Public NotInheritable Class DisplacementElementFailures
```
```cpp
public ref class DisplacementElementFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DisplacementElementFailures = class end
```

The BuiltInFailuresDisplacementElementFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotCopyDisplacementSetIntoOtherDocument | A Displacement Set can only be pasted into a view in the same document in which it was created. |
|  | CannotRemoveLastDisplacedElement | A Displacement Set can only be pasted into a view in the same document in which it was created. |
|  | DetectedCycleInDisplacedElementParents | Invalid parent relationship for a Displacement element. No cycles are allowed. |
|  | ElementsAlreadyDisplacedInView | You cannot copy a displacement set into a view if one or several of its elements already belong to another displacement set. |

#### Reference

Autodesk.Revit.DB Namespace